html/erlang-prog-lang-book.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head><!-- Global site tag (gtag.js) - Google Analytics --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Erlang程序设计</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="work" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="content">
<h1 class="title">Erlang程序设计</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org25ce5c8">1. 如何启动</a></li>
<li><a href="#org8269ce0">2. 数据类型</a></li>
<li><a href="#org20750c3">3. 控制结构</a></li>
<li><a href="#orge82ff11">4. 文件属性</a></li>
<li><a href="#orgdd5492a">5. 并发编程</a></li>
<li><a href="#org7936bdf">6. 其他特性</a></li>
</ul>
</div>
</div>

<div id="outline-container-org25ce5c8" class="outline-2">
<h2 id="org25ce5c8"><span class="section-number-2">1</span> 如何启动</h2>
<div class="outline-text-2" id="text-1">
<p>
通常erlang源代码会保存为.erl文件，但是也有.hrl文件（和C的header文件类似），erlang编译器也使用了宏和预处理机制来处理代码。
</p>

<p>
编译器 <code>erlc</code> 将.erl文件编译成为.beam文件，然后由运行器 <code>erl</code> 来执行。如果我们有一个hello.erl, 我们想执行里面start函数的话，可以运行 <code>erl -noshell -s hello start -s init stop</code>
</p>

<p>
除了编译/运行方式外，还可以以script方式执行，比如下面
</p>
<pre class="example">
#!/usr/bin/env escript

main(Args) -&gt;
    io:format("Hello world~n")
</pre>

<p>
此外我们还可以在erl里面执行某个模块的函数. c(test).用来编译这个模块，test:my<sub>func</sub>().来运行这个函数。erlang里面使用.表示结束。
</p>
<pre class="example">
3&gt; c(test).
{ok,test}
4&gt; test:my_func().
P = 1, Q = 2ok
6&gt; halt().
</pre>
</div>
</div>

<div id="outline-container-org8269ce0" class="outline-2">
<h2 id="org8269ce0"><span class="section-number-2">2</span> 数据类型</h2>
<div class="outline-text-2" id="text-2">
<p>
首先erlang里面需要恰当使用逗号(,), 分号(;) 和句号(;). 大致逻辑是这样的
</p>
<ul class="org-ul">
<li>逗号(,)用于分隔多个表达式的顺序执行。</li>
<li>分号(;)用于分隔多种cases, 比如一个函数的多个匹配模式等。</li>
<li>句号(.)用来表示整个结构结束。</li>
</ul>
<p>
如果使用英语类比的话，逗号(,)是分隔一个句子里面的多个短句, 分号(;)则用来分隔一个段落里面的多条句子, 句号(.)则表示整个段落的结束。
</p>

<p>
注释(comment). % 开头一行都是注释，不过在emacs下面 %% 注释会高亮。
</p>

<p>
符号(symbol). 和许多函数式编程语言一样，erlang里面也有符号，在这里叫做原子。符号必须小写开头，如果有空格的话可以使用''包括进来。如果想动态创建符号的话可以用 <code>erlang:make_ref</code>
</p>

<p>
变量(variable). 变量必须大写开头，并且所有变量都是Immutable的。赋值本质上可以认为是模式匹配 <code>X=1.</code> . 如果某个变量可能不使用的话（比如包含在一个debug分支中），那么可以使用<sub>开头</sub>，这个和python的匿名变量类似，但是不同的是你依然可以使用这个变量 <code>(P, _Q) = (1, 2).</code>
</p>

<p>
字符串(string). 字符串本质上可以认为是数组，如果将字符串放在模式匹配中可以匹配到数组上面，比如 <code>[H|T] = "hello".</code>, 那么H="h", T则是"ello". 反过来你也可以 <code>io:format("print string ~s~n", [[104, 101, 108, 108, 111]]).</code> ，又或者是 "X = [104, 101, 108, 108, 111]" 都是可以的。另外也允许使用 "X = [$h, $e]" 来赋值。其中 $h = 104, 这个是数字的另外一种表示方式
</p>

<p>
数字(number). 除了常规的数字表示方法外，还有\x{cdef}主要用于表示unicode字符， $a则表示'a'对应的数值，而2#1111开头的2表示二进制后面则是数值内容。
</p>

<p>
元组(tuple). {hello, world, 123, "aaa"}, 和其他编程语言比如python里面的元组差不多。元组没有办法灵活匹配，而列表则很容易。
</p>

<p>
列表(list). [hello, world, 123, "aaa"]. 匹配起来非常简单，比如[A, B | T] = [1,2,3,4]. 的话，那么A = 1, B = 2, T = [3,4]. 和模式匹配相对应的是，可以使用相同的办法来组合列表。列表也支持列表解析(list compreshension). 这个会在后面提到。
</p>

<p>
记录(record). 记录和元组非常类似，但是好处是可以部分匹配。定义方式是 <code>-record(person, {name, age, k3})</code> , 之后可以使用 X=#person{name = "yan"} 来创建，修改的话可以使用 X#person{name = "zhang"}. 匹配的话可以用 #person{name = Name, age = Age} = Z. 当然也能用Z#person.name来提取字段。记录(record)的定义不能在erl里面完成，需要定义.hrl, 然后使用 rr("test.hrl"). 读进来。
</p>

<p>
映射(map). 映射和匿名记录有点像，#{ a =&gt; 1, b =&gt; 2} 来构造. 修改用 X#{a =&gt; 2} 或者是 X#{b : =  3}. 有些差别是 =&gt; 是如果原来没有key的话会添加，否则就更新。但是 : = 是如果没有key的话就直接报错。
</p>

<p>
二进制(binary). 和C的struct有点类似，<a id="orgbaf7bbf"></a>表示有三个字段顺序排列，当然也可以为里面每个字段设置bit size, 以及type还有endian等。erlang的二进制比较强大的地方是，可以很容易地充分利用模式匹配这个功能。
</p>
</div>
</div>

<div id="outline-container-org20750c3" class="outline-2">
<h2 id="org20750c3"><span class="section-number-2">3</span> 控制结构</h2>
<div class="outline-text-2" id="text-3">
<p>
函数定义. 可以看到函数定义也有点类似模式匹配，可以列举各种模式来决定执行行为
</p>
<pre class="example">
myfunc(Pattern1) -&gt; Expression1;
myfunc(Pattern3) when Predicate1 -&gt; Expression3;
myfunc(Pattern2) -&gt; Expression2.
</pre>
<p>
其中when是一个关卡(guard). 关卡可以同样使用在其他匹配结构中，比如 <code>case</code>, <code>if</code> 等
</p>

<p>
匿名函数结构是 <code>fun (Pattern) -&gt; Expression end</code> , 注意匿名函数只是一个表达式所以没有句号(.)结尾。看上去匿名函数模式匹配是有限的。fun 这个关键字还有一个使用地方，就是引用外部函数 <code>TimeFunc = fun erlang:time/0.</code> 可以得到函数对象。
</p>

<p>
块表达式 begin exp1, exp2, &#x2026; end. 整个结构返回最后一个表达式值。
</p>

<p>
case和if表达式的结构如下，两者其实挺像的
</p>
<pre class="example">
case Expression of
  Pattern1 [when Guard1] -&gt; Expression1;
  Pattern2 [when Guard2] -&gt; Expression2;
 ...
end

if
   Guard1 -&gt; Expression1;
   Guard2 -&gt; Expression2;
   ...
end
</pre>

<p>
通过try/catch表达式可以用来捕获异常，但是注意它仍然是一个表达式。可以使用如下三种方式抛出异常，以及对应接住异常方式
</p>
<ul class="org-ul">
<li>exit(Why). 匹配方式 exit:X -&gt; Expression. 通过信号（类似消息的方式）来广播，消息是{'EXIT', Pid, Why}</li>
<li>throw(Why). 匹配方式 throw:X -&gt; Expression. 这个是调用者能够遇见到的异常。</li>
<li>error(Why). 匹配方式 error:X -&gt; Expression. 这个是调用者不能够预期到的错误（“崩溃性错误”）</li>
</ul>
<p>
try/catch的结构如下
</p>
<pre class="example">
try Expression of
  Pattern1 [when Guard1] -&gt; Expression1;
  ...
catch
  ExceptionType1: Exception1 [ when ExGuard1 ] -&gt; ExExpression1;
  ...
after
  AfterExpression
end
</pre>
<p>
注意这个AfterExpression最后面无论如何都会执行，但是却不会作为表达式结果。
</p>

<p>
模式匹配里面有一个实用的小trick, 就是可以多次匹配。书中的例子是
</p>
<pre class="example">
func1([{tag, {one, A}, B} | T]) -&gt;
    ...
    func2(... {tag, {one, A}, B} ...)
</pre>
<p>
就是其实{tag&#x2026; B}这个里面匹配了一次，但是在func2的时候又要重新构造一次元组。如果使用多次匹配的话，就可以避免这个问题
</p>
<pre class="example">
func1([{tag, {one, A} = Z1, B} = Z2 | T]) -&gt;
    ...
    func2(... Z2 ...)
</pre>
</div>
</div>

<div id="outline-container-orge82ff11" class="outline-2">
<h2 id="orge82ff11"><span class="section-number-2">4</span> 文件属性</h2>
<div class="outline-text-2" id="text-4">
<p>
属性语法类似于 -SomeTag(&#x2026;) , 分为预定义属性和自定义属性。预定义的属性有
</p>
<ul class="org-ul">
<li>module(unity) 那么这个文件必须存为unity.erl. 这样代码加载才能找到</li>
<li>import/export([funcA/0, funcB/2])</li>
<li>compile(Options)</li>
<li>vsn(Version) 模块版本号</li>
<li>define(Func(Var1, Var2), &#x2026;) 宏，这个和C的宏很像，不过引用的时候需要带上?Func</li>
<li>include/include<sub>lib</sub>. 两个差别是用来区分库和自定义的头文件(.hrl文件)</li>
</ul>
<p>
每个模块编译之后，都会带上module<sub>info</sub>/0和module<sub>info</sub>/1两个函数，可以获取这些属性信息。
</p>
</div>
</div>

<div id="outline-container-orgdd5492a" class="outline-2">
<h2 id="orgdd5492a"><span class="section-number-2">5</span> 并发编程</h2>
<div class="outline-text-2" id="text-5">
<p>
通过spawn函数来创建线程，返回一个线程句柄（通常命名为Pid），之后可以往这个线程投递消息，比如 <code>Pid ! hello</code> 。
这个线程句柄的传递有两种方式：
</p>
<ul class="org-ul">
<li>如果在一个erlang进程里面传递，可以直接放在消息里面；</li>
<li>如果需要在不同进程/机器之间传递的话，可以将这个句柄和一个atom/name绑定起来 <code>register(serviceA, Pid)</code>, 然后在另外进程里面调用 <code>rpc:call(host, serviceA, params)</code> 序列化和反序列化都是自身内部提供好的。</li>
</ul>

<p>
容错方面的话，可以将多个线程之间关联起来，支持单向和双向两种。一旦某个线程退出的，所有与之关联的线程都会收到通知。
</p>
</div>
</div>

<div id="outline-container-org7936bdf" class="outline-2">
<h2 id="org7936bdf"><span class="section-number-2">6</span> 其他特性</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>类型推断和类型检查。 用户可以提供spec来帮助erlang来检查类型错误，两个程序dialyzer和typer</li>
<li>ETS/DETS/Mnesia. ETS全称是Erlang Term Storage, DETS则是Disk ETS. Mnesia是内置的数据库(DBMS)</li>
<li>性能分析，调试和跟踪工具。</li>
<li>动态代码载入。在任一时刻，Erlang允许一个模块的两个版本同时运行，重新编译某个模块代码，当前版成为旧版本。两个版本的代码可以同时运行。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: work</p>
<p class="date">Created: 2019-04-03 Wed 04:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
<div id="content"><!-- DISQUS BEGIN --><div id="disqus_thread"></div><script>/***  RECOMMENDED CONFIGURATION VARIABLES: EDIT AND UNCOMMENT THE SECTION BELOW TO INSERT DYNAMIC VALUES FROM YOUR PLATFORM OR CMS.*  LEARN WHY DEFINING THESE VARIABLES IS IMPORTANT: https://disqus.com/admin/universalcode/#configuration-variables*/var disqus_config = function () {this.page.url = 'https://maypeppa.github.io/html/erlang-prog-lang-book.html';this.page.identifier = 'erlang-prog-lang-book.html';};(function() {var d = document, s = d.createElement('script');s.src = 'https://dirlt.disqus.com/embed.js';s.setAttribute('data-timestamp', +new Date());(d.head || d.body).appendChild(s);})();</script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><!-- DISQUS END --></div></body>
</html>
